In [3]:
import pandas as pd
from sqlalchemy import create_engine
from datetime import datetime

# Ebola

In [2]:
# epidemic_ebola='/Users/maheshdivakarannair/Documents/GitHub/project-outbreak/data_sets/epidemic/ebola.csv'
epidemic_ebola='/Users/aracelyvivanco/Desktop/project-outbreak-master/data_sets/epidemic/ebola.csv'

In [3]:
epidemic_ebola_df = pd.read_csv(epidemic_ebola)

In [4]:
epidemic_ebola_df.head()

,Country,Date,No. of suspected cases,No. of probable cases,No. of confirmed cases,"No. of confirmed, probable and suspected cases",No. of suspected deaths,No. of probable deaths,No. of confirmed deaths,"No. of confirmed, probable and suspected deaths"
0,Guinea,2014-08-29,25.0,141.0,482.0,648.0,2.0,141.0,287.0,430.0
1,Nigeria,2014-08-29,3.0,1.0,15.0,19.0,0.0,1.0,6.0,7.0
2,Sierra Leone,2014-08-29,54.0,37.0,935.0,1026.0,8.0,34.0,380.0,422.0
3,Liberia,2014-08-29,382.0,674.0,322.0,1378.0,168.0,301.0,225.0,694.0
4,Sierra Leone,2014-09-05,78.0,37.0,1146.0,1261.0,11.0,37.0,443.0,491.0

In [31]:
epidemic_ebola_df_2 = epidemic_ebola_df[['Date','Country', 'No. of confirmed cases', 'No. of confirmed deaths']]
epidemic_ebola_df_2 = epidemic_ebola_df_2.rename(columns = {'No. of confirmed cases':'Confirmed_cases', 'No. of confirmed deaths':'Confirmed_Death'})

epidemic_ebola_df_2.head()

         Date       Country  Confirmed_cases  Confirmed_Death
0  2014-08-29        Guinea            482.0            287.0
1  2014-08-29       Nigeria             15.0              6.0
2  2014-08-29  Sierra Leone            935.0            380.0
3  2014-08-29       Liberia            322.0            225.0
4  2014-09-05  Sierra Leone           1146.0            443.0

In [32]:
len(epidemic_ebola_df_2)

2485

In [8]:
# rds_connection_string = "mahesh2:mahesh@localhost:5432/marketing_db"
rds_connection_string = "postgres:postgres@localhost:5432/marketing_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [9]:
epidemic_ebola_df_2.to_sql(name='ebola_epidemic', con=engine, if_exists='replace', index=False)

In [10]:
pd.read_sql_query('select * from ebola_epidemic', con=engine).head()

         Date       Country  Confirmed_cases  Confirmed_Death
0  2014-08-29        Guinea            482.0            287.0
1  2014-08-29       Nigeria             15.0              6.0
2  2014-08-29  Sierra Leone            935.0            380.0
3  2014-08-29       Liberia            322.0            225.0
4  2014-09-05  Sierra Leone           1146.0            443.0

# Corona

In [11]:
# epidemic_corona='/Users/maheshdivakarannair/Documents/GitHub/project-outbreak/data_sets/epidemic/covid_19.csv'
epidemic_corona='/Users/aracelyvivanco/Desktop/project-outbreak-master/data_sets/epidemic/covid_19.csv'

In [12]:
epidemic_corona_df = pd.read_csv(epidemic_corona)

In [13]:
epidemic_corona_df.head()

,Province/State,Country/Region,Lat,Long,Date,Confirmed,Deaths,Recovered
0,Anhui,Mainland China,31.8257,117.2264,1/22/20,1,0,0
1,Beijing,Mainland China,40.1824,116.4142,1/22/20,14,0,0
2,Chongqing,Mainland China,30.0572,107.8740,1/22/20,6,0,0
3,Fujian,Mainland China,26.0789,117.9874,1/22/20,1,0,0
4,Gansu,Mainland China,36.0611,103.8343,1/22/20,0,0,0

In [15]:
# Selecting necessary columns and renaming them. Droping others
epidemic_corona_df_2 = epidemic_corona_df[['Date','Country/Region', 'Confirmed', 'Deaths']]
epidemic_corona_df_2 = epidemic_corona_df_2.rename(columns = {'Country/Region':'Country','Confirmed':'Confirmed_cases','Deaths':'Confirmed_Death'}) 
len(epidemic_corona_df_2)

10350

In [16]:
# Renaming countries 
epidemic_corona_df_2["Country"].replace({"Mainland China": "China", "US": "United States of America", "UK": "United Kingdom",
                                        "French Guiana":"France", "Hong Kong":"Hong Kong S.A.R.","Macau":"China",
                                         "Others":"Diamond Princess Cruise Ship", "Serbia":"Republic of Serbia",
                                         "Vatican City": "Italy"}, inplace=True)

epidemic_corona_df_2.head()

      Date Country  Confirmed_cases  Confirmed_Death
0  1/22/20   China                1                0
1  1/22/20   China               14                0
2  1/22/20   China                6                0
3  1/22/20   China                1                0
4  1/22/20   China                0                0

In [17]:
epidemic_corona_df["Date"]= datetime.strptime(epidemic_corona_df["Date"], "%d %B, %Y")

TypeError: strptime() argument 1 must be str, not Series

In [19]:
# rds_connection_string = "mahesh1:mahesh@localhost:5432/marketing_db"
rds_connection_string = "postgres:postgres@localhost:5432/marketing_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [20]:
epidemic_corona_df_2.to_sql(name='corona_epidemic', con=engine, if_exists='replace', index=False)

In [21]:
pd.read_sql_query('select * from corona_epidemic', con=engine).head()

      Date Country  Confirmed_cases  Confirmed_Death
0  1/22/20   China                1                0
1  1/22/20   China               14                0
2  1/22/20   China                6                0
3  1/22/20   China                1                0
4  1/22/20   China                0                0

# SARS

In [4]:
# epidemic_ebola='/Users/maheshdivakarannair/Documents/GitHub/project-outbreak/data_sets/epidemic/ebola.csv'
epidemic_sars='/Users/maheshdivakarannair/Downloads/sars_2003_complete_dataset_clean.csv'

In [5]:
epidemic_sars_df = pd.read_csv(epidemic_sars)
epidemic_sars_df.head()

      Date    Country  Cumulative number of case(s)  Number of deaths
0   4/1/03  Australia                             1                 0
1  4/17/03  Australia                             2                 0
2  4/23/03  Australia                             1                 0
3  5/22/03  Australia                             2                 0
4   4/1/03    Belgium                             1                 0

In [6]:
epidemic_sars_df_2 = epidemic_sars_df
epidemic_sars_df_2 = epidemic_sars_df_2.rename(columns = {'Cumulative number of case(s)':'Confirmed_cases', '	Number of deaths':'Confirmed_Death'})

epidemic_sars_df_2.head()

      Date    Country  Confirmed_cases  Number of deaths
0   4/1/03  Australia                1                 0
1  4/17/03  Australia                2                 0
2  4/23/03  Australia                1                 0
3  5/22/03  Australia                2                 0
4   4/1/03    Belgium                1                 0

In [7]:
# Renaming countries 
epidemic_sars_df_2["Country"].replace({'Hong Kong SAR, China': 'Hong Kong S.A.R.', 'Macao SAR, China': 'Macao S.A.R',
                                       'Republic of Ireland': 'Ireland', 'United States': 'United States of America', 
                                       'Taiwan, China': 'Taiwan', 'Russian Federation': 'Russia',
                                       'Viet Nam': 'Vietnam'}, inplace=True)

epidemic_sars_df_2.head()

      Date    Country  Confirmed_cases  Number of deaths
0   4/1/03  Australia                1                 0
1  4/17/03  Australia                2                 0
2  4/23/03  Australia                1                 0
3  5/22/03  Australia                2                 0
4   4/1/03    Belgium                1                 0

In [8]:
# rds_connection_string = "mahesh1:mahesh@localhost:5432/marketing_db"
rds_connection_string = "mahesh1:mahesh@localhost:5432/marketing_db"
engine = create_engine(f'postgresql://{rds_connection_string}')

In [9]:
epidemic_sars_df_2.to_sql(name='sars_epidemic', con=engine, if_exists='replace', index=False)

In [10]:
pd.read_sql_query('select * from sars_epidemic', con=engine).head()

      Date    Country  Confirmed_cases  Number of deaths
0   4/1/03  Australia                1                 0
1  4/17/03  Australia                2                 0
2  4/23/03  Australia                1                 0
3  5/22/03  Australia                2                 0
4   4/1/03    Belgium                1                 0